# IsOBJImportLinkAvailable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OptionalFunctionalityUtils..::..IsOBJImportLinkAvailable Method
OptionalFunctionalityUtils Class See Also
---
Checks whether the OBJ Import/Link functionality is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public static bool IsOBJImportLinkAvailable()
```

Visual Basic
---
```text
Public Shared Function IsOBJImportLinkAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsOBJImportLinkAvailable()
```

# ### Return Value
True if the OBJ Import/Link functionality is available in the installed Revit.
# Remarks
OBJ Import/Link is optional functionality that does not have to be a part of the Revit installation.
# See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace